---
type: FluidTemperature
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 6
tags: [revit-api, class]
---

# FluidTemperature

`Autodesk.Revit.DB.Plumbing.FluidTemperature` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FluidTemperature | 2013 | `public FluidTemperature ( double temperature , double viscosity , double density )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Density | 2013 | `public double Density { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Temperature | 2013 | `public double Temperature { get ; set ; }` |
| Property | Viscosity | 2013 | `public double Viscosity { get ; set ; }` |